# Homebrew Bundle: CLI tools and runtimes
# Safe to re-run: brew bundle will converge state.

# Required CLI tools
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "jq"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "eza"
brew "bat"
brew "tmux"
brew "vim"
brew "fd"

# Prompt / shells
brew "starship"

# Node / Python managers
brew "nvm"
brew "pyenv"
