# Homebrew Bundle: CLI tools and apps
# Safe to re-run: brew bundle will converge state.
#
# Not managed here (install manually):
#   opencode: npm install -g opencode-ai  OR  see https://opencode.ai

# Version control
brew "git"
brew "gh"

# Shell / terminal
brew "starship"
brew "tmux"
brew "vim"

# File / search utilities
brew "tree"
brew "wget"
brew "curl"
brew "jq"
brew "ripgrep"

# Media
brew "ffmpeg"
brew "yt-dlp"

# Language runtimes / managers
brew "nvm"
brew "rbenv"
brew "uv"
brew "ollama"

# Fonts
cask "font-jetbrains-mono-nerd-font"
